# Задача_1
a = '5'
b = 17
c = 23.5
weight = 17
print(weight)
weight = input('Укажите возраст:')
print('Возраст:',weight)

# Задача_2
number = input('Введите целое число:')
print(int(number)+2)


# Задача_3
age = int(input('Укажите возраст:'))
if age >= 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')